# Задача 22
# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, 
# стоящих на нечётной позиции.

# Пример:

# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# in_list = list(input('Задайте список из нескольких чисел без разделителей: '))
# print(in_list)

# n = len(in_list)
# summ_chet = 0
# for i in range(0, n, 2):
#     summ_chet += int(in_list[i])
# summ_nechet = 0
# for i in range(1, n, 2):
#     summ_nechet += int(in_list[i])
# print('Сумма чётных элементов: ', (summ_chet))
# print('Сумма НЕчётных элементов: ', + (summ_nechet))

#==============================================================================

# Задача 23
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, 
# второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

# in_list = list(input('Задайте список из нескольких чисел без разделителей: '))
# print(in_list)
# n = len(in_list)

# if n % 2 == 1:
#     out_list = [0] * (n // 2 + 1)
# else:
#     out_list = [0] * (n // 2)

# for i in range(len(out_list)):
#     out_list[i] = int(in_list[i]) * int(in_list[n-1-i])

# print(out_list)

#====================================================================================

# Задача 24
# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между 
# максимальным и минимальным значением дробной части элементов.

# Пример:

# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# n = int(input('Сколько вещественных чисел вы будете задаваь? '))
# if n < 2:
#     print('Надо ввести минимум 2 числа!')
#     exit()
# in_list = list([0] * n)

# for _ in range(n):
#     in_list[_] = float(input('Введите число: '))
# print(in_list)
# maxx = in_list[0] % 1
# mini_maxx = in_list[1] % 1

# # for i in range(n):                       # всю голову сломал
# #     if in_list[i] % 1 >= maxx:           # в случае с числом 5 в примере, дробная часть равна 0 и ответ 0.2 
# #         maxx = in_list[i] % 1            # чтобы это учесть сделал проверку дополнительную
# #     if in_list[i] % 1 <= mini_maxx:
# #         mini_maxx = in_list[i] % 1
# for i in range(n):
#     if in_list[i] % 1 !=0 and in_list[i] % 1 >= maxx:
#         maxx = in_list[i] % 1
#     if in_list[i] % 1 !=0 and in_list[i] % 1 <= mini_maxx:
#         mini_maxx = in_list[i] % 1 

# print(round((maxx - mini_maxx), 2))

#==============================================================================

# Задача 25
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

# Пример:

# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

# n = int(input('Введите деятичное число: '))
# n_out = n # используем для красивой печати
# binary = []
# x = n
# while x >= 1:
#     x = n // 2
#     binary.append(n - x * 2)
#     n = x
# else:
#     print(f'{n_out} -> ', *binary, sep='')

#=========================================================================================

# Задача 26
# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

# Пример:

# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] 

k = int(input('Введите целое число: '))
list_fibonachchi = [0] * (2 * k +1)
list_fibonachchi[k+1] = 1
list_fibonachchi[k+2] = 1

for i in range((k + 3), (k*2+1)):
    list_fibonachchi[i] = list_fibonachchi[i-1] + list_fibonachchi[i-2]
    
for i in range((k - 1), -1, -1):
    list_fibonachchi[i] = list_fibonachchi[i+2] - list_fibonachchi[i+1]
print(list_fibonachchi)